<template>
  <div class="">{{ result }}*****************{{ text }}</div>
</template>
<script>
import { numberToString } from '../../utils'

export default {
  data() {
    return {
      value: null,
      options: [{
        value: '选项1',
        label: '黄金糕'
      }, {
        value: '选项2',
        label: '双皮奶'
      }, {
        value: '选项3',
        label: '蚵仔煎'
      }, {
        value: '选项4',
        label: '龙须面'
      }, {
        value: '选项5',
        label: '北京烤鸭'
      }],
      result: [],
      text:
          '2*综合+++*' +
          '2.1*服饰 apparel and accessories+++*' +
          '装饰人体的物品总称（包括服装、鞋帽、袜子、手套、围巾、领带、提包等）。+++*' +
          '2.2*服装 garments , clothing , apparel+++*' +
          '穿于人体起保护和装饰作用的制品。+++*' +
          '2.3*时装 fashion+++*' +
          '在一定时间、空间内，为相当一部分人所接受的新颖入时的流行服装。+++*' +
          '2.4*成衣 ready-to-wear+++*' +
          '按照规定的尺寸，以批量生产方式制作的服装。+++*' +
          '2.5*定制服装 customer made+++*' +
          '根据个人量体尺寸，单件剪裁， 制作完成的服装。+++*' +
          '2.6*毛呢服装 woolen garment+++*' +
          '由纯毛、毛混纺织物为面料制成的服装。+++*' +
          '2.7*棉布服装 cotton clothes+++*' +
          '由全棉、棉混纺织物制成的服装。+++*' +
          '2.8*丝绸服装 silk garment+++*' +
          '由天然丝、人造丝、合成丝织物制成的服装。+++*' +
          '2.9*化纤服装 chemical fiber garment+++*' +
          '由各种化学纤维织物制成的服装。+++*' +
          '2.10*裘革服装 fur or leather garment+++*' +
          '由裘皮或革皮制成的服装。+++*' +
          '2.11*羽绒服装 down garment+++*' +
          '内充羽绒的服装。+++*' +
          '2.12*人造毛皮服装 artificial fur and leather garment+++*' +
          '由天然或化学纤维仿各种毛皮的织物为面料制成的服装。+++*' +
          '2.13*男式服装 men\'s wear+++*' +
          '成年男子穿着的服装。+++*' +
          '2.14*女式服装 women\'s wear+++*' +
          '成年女子穿着的服装。+++*' +
          '2.15*儿童服装 children\'s wear+++*' +
          '适合儿童穿着的服装。+++*' +
          '2.16*婴儿服装 infant\'s wear+++*' +
          '适合周岁以内婴儿穿着的服装。+++*' +
          '3*服装成品+++*' +
          '3.1*上装+++*' +
          '3.1.1*西服 suit+++*' +
          '西式上衣。按钉纽扣不同，可分为单排口西服、双排扣西服等；按驳头不同，可分为平驳头西服、戗驳头西服等。+++*' +
          '3.1.2*中山服 zhongshan jacket+++*' +
          '根据孙中山先生曾穿着的立领、贴袋衣服的式样演变而成的上衣。+++*' +
          '3.1.3*军便装 undress uniform+++*' +
          '仿军服式样的上衣。+++*' +
          '3.1.4*青年服 young men\'s jacket+++*' +
          '立领、三开袋或三贴袋式样的上衣。 ·+++*' +
          '3.1.5*茄克衫 jacket+++*' +
          '衣长较短，宽胸围、紧袖口、紧下摆式样的上衣。+++*' +
          '3.1.6*猎装 hunting coat+++*' +
          '原打猎时穿的服装，现在已发展为日常生活穿的多口袋、开背*式样上衣，有短袖、长袖之分。+++*' +
          '3.1.7*衬衫 shirt(男）、blouse(女）+++*' +
          '穿在内外上衣之间，也可单独穿用的上衣。男衬衫通常胸前有口袋，袖口有袖头。+++*' +
          '3.1.8*中西式上衣 eastern and western style coat+++*' +
          '中式，装袖的上衣。+++*' +
          '3.1.9*中式上衣 Chinese style coat+++*' +
          '中式领，连袖的上衣，有单、夹之分。+++*' +
          '3.1.10*牛仔服 cowboy wear+++*' +
          '原美国西部牛仔穿的上衣，现在已发展为日常生活的上衣，多用坚固呢制作。主要有牛仔茄克衫、牛仔衬衫、牛仔背心等品种。+++*' +
          '3.1.11*棉袄 cotton wadded jacket+++*' +
          '内絮棉花、化纤棉、驼毛等保暖材料的上衣。有中式棉袄、中西式棉袄之分。+++*' +
          '3.1.12*羽绒服 down wear+++*' +
          '内充羽绒的上衣，具保暖性，为寒冷地区穿着。+++*' +
          '3.1.13*防寒服 cotton wadded jacket+++*' +
          '内絮化纤棉等保暖材料的上衣。款式不拘。+++*' +
          '3.1.14*背心 vest+++*' +
          '无袖上衣。可穿于外衣之内，也可穿于外面，便于双手活动。主要有西服背心，棉背心，羽绒背心等品种。+++*' +
          '3.2*下装+++*' +
          '3.2.1*西裤 trousers+++*' +
          '裤管有侧缝，穿着分前后，注意与体型协调的裤。+++*' +
          '3.2.2*西短裤 short pants+++*' +
          '工艺上与西裤基本相同，裤长在膝盖以上的短裤。+++*' +
          '3.2.3*中式裤 Chinese style slack+++*' +
          '传统的大裤腰，无侧缝，无前后之分的裤。+++*' +
          '3.2.4*背带裤 overalls+++*' +
          '有背带的裤。+++*' +
          '3.2.5*马裤 riding breeches+++*' +
          '骑马时穿的裤腿收紧的裤。+++*' +
          '3.2.6*灯笼裤 knickerbockers+++*' +
          '裤管宽大、脚口收紧似灯笼状的裤。+++*' +
          '3.2.7*裙裤 culotte+++*' +
          '裤管展宽、外观似裙的裤。+++*' +
          '3.2.8*牛仔裤 jeans+++*' +
          '为美国拓荒时期，以帆布制成的坚牢工作裤所演变而来，现多用坚固呢制成的裤。+++*' +
          '3.2.9*连衣裤 jumpsuit+++*' +
          '上衣与裤子相连接的服装。+++*' +
          '3.2.10*喇叭裤 bell-bottom trousers+++*' +
          '裤腿呈喇叭状的西裤。+++*' +
          '3.2.11*棉裤 cotton wadded trousers+++*' +
          '内絮棉花、化纤棉、驼毛等保暖材料的御寒裤。+++*' +
          '3.2.12*羽绒裤 down wadded trousers+++*' +
          '内充羽绒的御寒裤。+++*' +
          '3.2.13*连衣裙 dress+++*' +
          '上衣下裙连成一件式的服装。+++*' +
          '3.2.14*背心裙 jumper skirt+++*' +
          '无领、无袖的背心状连裙装。+++*' +
          '3.2.15*斜裙 A-line skirt+++*' +
          '由腰部至下摆斜向展开呈"A"字形的裙。+++*' +
          '3.2.16*喇叭裙 flare skirt+++*' +
          '裙体上部与人体腰臀紧贴附，由臀线斜向下展开，形状如喇叭的裙。+++*' +
          '3.2.17*超短裙 mini-skirts+++*' +
          '一种下摆在大腿中部或以上的短裙。+++*' +
          '3.2.18*褶裙 pleated-skirt+++*' +
          '整个裙身由有规则的褶形组成的裙。+++*' +
          '3.2.19*节裙 tiered skirt+++*' +
          '裙体以多层次的横向多片剪接，外形如塔状的裙。+++*' +
          '3.2.20*简裙 straight skirt　+++*' +
          '从腰开始自然垂落的筒状或管状裙。+++*' +
          '3.2.21*旗袍裙 Qipao style skirt+++*' +
          '左右侧缝开*的裙。+++*' +
          '3.2.22*西服裙 skirt+++*' +
          '与西服上衣配套，通常采用收省、打褶等方法使裙体合身，长度在膝盖上下的裙子。+++*' +
          '3.3*全身装+++*' +
          '3.3.1*风雨衣 all-weather coat+++*' +
          '防风防雨两用单、夹长外衣。+++*' +
          '3.3.2*风衣 trench coat+++*' +
          '防风单、夹长外衣。+++*' +
          '3.3.3*披风 cape+++*' +
          '无袖，披在肩上的防风外衣。+++*' +
          '3.3.4*斗蓬 mantle+++*' +
          '有帽的披风。+++*' +
          '3.3.5*大衣 overcoat+++*' +
          '为了防御风寒，穿在一般衣服外面的外衣，款式按流行时尚而变化。主要有毛呢大衣、棉大衣、羽绒大衣、裘皮大衣、革皮大衣、人造毛皮大衣等品种。+++*' +
          '3.3.6*旗袍Qipao+++*' +
          '立领，右大襟，紧腰身，下摆开*的中国传统女袍。+++*' +
          '3.3.7*睡袍 night-gown+++*' +
          '卧室中穿的宽松而较长的袍服。+++*' +
          '3.3.8*睡衣裤 pyjamas+++*' +
          '包含上衣和裤子的二件式睡衣。+++*' +
          '3.3.9*套装 suits+++*' +
          '上下装配套穿用的服装。由同色同料或造型格调一致的衣、裤、裙等相配而成。+++*' +
          '3.4*礼服+++*' +
          '3.4.1*新娘礼服 wedding gown　+++*' +
          '源于欧美地区，新娘行婚礼时穿的礼服。+++*' +
          '3.4.2*燕尾服 swallowtailed coat+++*' +
          '为男士在特定场合穿的礼服，前身短，后身如燕尾形呈二片开*。+++*' +
          '3.4.3*夜礼服 evening dress+++*' +
          '在夜间社交场合中，妇女所穿的华丽裙服。+++*' +
          '3.5*职业服 business suit+++*' +
          '行业人员从业时按规定穿着的具有标识性的专用服装。有邮电服、铁路服、海关服、海运服、民航服、税务服、交通监督服、工商管理服等。+++*' +
          '3.6*劳动保护服 working wear+++*' +
          '特殊行业人员工作时提供便利和保护人体的服装。有矿工服、炼钢服、石油工人服、养路I作服等。+++*' +
          '4*服装部位、部件+++*' +
          '4.1*上装部位+++*' +
          '4.1.1*前身+++*' +
          '4.1.1.1*肩缝 shoulder seam+++*' +
          '前后肩连接的部位。+++*' +
          '4.1.1.2*领嘴 notch+++*' +
          '领底口末端至门里襟止口的部位。+++*' +
          '4.1.1.3*门襟 closing+++*' +
          '锁眼的衣片。+++*' +
          '4.1.1.4*门襟止口 front edge+++*' +
          '门襟的边沿。+++*' +
          '4.1.1.5*搭门 front overlap+++*' +
          '门里襟叠在一起的部位。+++*' +
          '4.1.1.6*扣眼 buttonhole+++*' +
          '扣钮的眼孔。+++*' +
          '4.1.1.7*眼距 buttonhole spacing+++*' +
          '扣眼间的距离。+++*' +
          '4.1.1.8*袖窿 armhole+++*' +
          '绱袖的部位。+++*' +
          '4.1.1.9*驳头 lapel+++*' +
          '门里襟上部翻折部位。+++*' +
          '4.1.1.9.1*平驳头 notch lapel+++*' +
          '与上领片的夹角呈三角形缺口的方角驳头。+++*' +
          '4.1.1.9.2*戗驳头 peak lapel+++*' +
          '驳角向上形成尖角的驳头。+++*' +
          '4.1.1.10*胸部 chest+++*' +
          '衣服前胸丰满处。+++*' +
          '4.1.1.11*腰节 waist line+++*' +
          '衣服腰部最细处。+++*' +
          '4.1.1.12*摆缝 side seam+++*' +
          '袖窿下面由前后身连接的缝。+++*' +
          '4.1.1.13*里襟 under lap+++*' +
          '钉扣的衣片。+++*' +
          '4.1.1.14*底边 hem+++*' +
          '衣服下部的边沿部位。+++*' +
          '4.1.1.15*串口 gorge+++*' +
          '领面与驳头面缝合处。+++*' +
          '4.1.1.16*假眼 mock button hole+++*' +
          '不开眼口的装饰用扣眼。+++*' +
          '4.1.1.17*驳口 roll line+++*' +
          '驳头翻折部位。+++*' +
          '4.1.1.18*单排扣 single breasted+++*' +
          '里襟钉一排钮扣。+++*' +
          '4.1.1.19*双排扣 double breasted+++*' +
          '门里襟各钉一排钮扣。+++*' +
          '4.1.1.20*止口圆角 front cut+++*' +
          '门里襟下部的圆头。+++*' +
          '4.1.1.21*前后披肩 front or back shoulder cape+++*' +
          '覆盖在肩部前后的部件。+++*' +
          '4.1.1.22*扣位 button placement+++*' +
          '钮扣的位置。+++*' +
          '4.1.1.23*滚眼 bound button hole+++*' +
          '用面料做的扣眼。+++*' +
          '4.1.1.24*前过肩 front yoke+++*' +
          '连接前身与肩缝合的部件。+++*' +
          '4.1.1.25*门襟翻边 placket+++*' +
          '外翻的门襟边。+++*' +
          '4.1.1.26*领省 neckline dart+++*' +
          '领窝部位的省道。+++*' +
          '4.1.1.27*前腰省 front waist dart+++*' +
          '衣服前身腰部的省道。+++*' +
          '4.1.1.28*胁省 underarm dart+++*' +
          '衣服两侧腋下处的省道。+++*' +
          '4.1.1.29*横省 side dart+++*' +
          '腋下摆缝处至胸部的省道。+++*' +
          '4.1.1.30*前肩省 front shoulder dart+++*' +
          '前身肩部的省道。+++*' +
          '4.1.1.31*肚省 fish dart+++*' +
          '大袋口部位的横省。+++*' +
          '4.1.1.32*前身通省 front open dart+++*' +
          '从肩缝到下摆的开刀缝。+++*' +
          '4.1.1.33*刀背缝 princess seam+++*' +
          '弯形的开刀缝。+++*' +
          '4.1.2*后身+++*' +
          '4.1.2.1*总肩 across back shoulder+++*' +
          '从左肩端至右肩端的部位。+++*' +
          '4.1.2.2*后过肩 back yoke+++*' +
          '连接后身与肩缝合的部件。+++*' +
          '4.1.2.3*背缝 center back seam+++*' +
          '后身中间缝合的缝子。+++*' +
          '4.1.2.4*背* vent+++*' +
          '背缝下部开*。+++*' +
          '4.1.2.5*摆* side vent+++*' +
          '摆缝下部开*。+++*' +
          '4.1.2.6*后搭门 back overlap+++*' +
          '门里襟开在后背处。+++*' +
          '4.1.2.7*领窝 neckline+++*' +
          '前后身与领子缝合的部位。+++*' +
          '4.1.2.8*后领省 back neck dart+++*' +
          '后领窝处呈八字形的省道。+++*' +
          '4.1.2.9*后肩省 back shoulder dart+++*' +
          '后身肩部的省道。+++*' +
          '4.1.2.10*后腰省 back waist dart+++*' +
          '后身腰部的省道。+++*' +
          '4.1.2.11*后身通省 back open dart+++*' +
          '从肩缝到下摆的开刀缝。+++*' +
          '4.2*下装部位+++*' +
          '4.2.1*waistband 裤头+++*' +
          '4.2.2*waistband button 腰头钮+++*' +
          '4.2.3*button tab 里襟尖咀+++*' +
          '4.2.4*waistband lining 裤头里+++*' +
          '4.2.5*bearer button 裤头钮+++*' +
          '4.2.6*extended tab 宝剑头，裤头搭咀+++*' +
          '4.2.7*left fly 门襟，钮牌+++*' +
          '4.2.8*fly buttonhole 钮牌扣眼+++*' +
          '4.2.9*front fly 裤门襟+++*' +
          '4.2.10*crutch lining 裤裆垫布+++*' +
          '4.2.11*side seam 侧骨+++*' +
          '4.2.12*inside seam 下裆缝+++*' +
          '4.2.13*reinforcement for knees 膝盖绸+++*' +
          '4.2.14*leg opening 裤脚+++*' +
          '4.2.15*turn-up cuff 卷脚，反脚+++*' +
          '4.2.16*heel stay 贴脚条+++*' +
          '4.2.17*crease line 裤中线+++*' +
          '4.2.18*fly button 钮扣+++*' +
          '4.2.19*right fly 里襟，钮子+++*' +
          '4.2.20*slant pocket 斜插袋+++*' +
          '4.2.21*front waist pleat 前腰褶+++*' +
          '4.2.22*watch pocket / coin pocket 表袋+++*' +
          '4.2.23*beltloop 裤耳+++*' +
          '4.2.24*hip pocket 后袋+++*' +
          '4.2.25*seat seam / back rise 后裆缝/后浪+++*' +
          '4.2.26*back waist dart 后褶'
    }
  },
  created() {
    this.init()
    this.toString()
  },
  methods: {
    toString() {
      console.log(numberToString())
    },
    init() {
      const map = new Map()
      const list = this.text.split('*')
      for (let i = 0; i < list.length; i++) {
        const list1 = []
        const item = list[i]
        console.log(item)
        if (item.length === 1 && (/\d/).test(item)) {
          list1.push(list[i + 1])
          this.result.push(list1)
        }
        if (item.split('.').length === 2) {
          const list2 = [list[i + 1] + list[i + 2]]
          const j = item.split('.')[0]
          this.result[j - 2].push(list2)
        }

        if (item.split('.').length === 3) {
          const c1 = item.split('.')[0]
          const c2 = item.split('.')[1]

          const list3 = list[i + 1] + list[i + 2]
          this.result[c1 - 2][c2 ].push(list3)
        }
        if (item.split('.').length === 4) {
          console.log('四级分类')
        }
      }
      console.log(this.result)
    }
  }
}
</script>

<style lang="scss" scoped>
  .index {
  }
</style>
